[
{"topic": "Is LGBTQ+ wrong?", "category": "Society", "pro_arguments": [{"title": "LGBTQ+ is Homosexuality and the Bible says it is wrong", "body": "LGBTQ+ is homosexuality. Multiple times in the Bible we are told to flee from sexual immorality, And in the Old Testament, Extreme punishments were given for those who practiced homosexuality. The temptation itself is not a sin, The wrong part comes in when you choose to go along with the temptation. Bible verses showing homosexuality is wrong are Leviticus 18:22, Leviticus 20:13, Romans 1:26-27, 1 Corinthians 6:9-10, And 1 Timothy 1:10."}, {"title": "I don't hate gays,", "body": "Let me make this real clear: I don't hate homosexuals, Bisexuals asexuals, All the other sexuals or transgenders. I just disagree with their sense of right and wrong. And either it's the world's biggest coincidence or the USA turned into a hellhole shortly after Barack Obama or the Supreme Court or whatever legalized gay marriage. I don't blame gays for this. I blame Obama."}, {"title": "Its homosexuality, Not the homosexual that is evil", "body": "For the past few decades we have seen a ever growing trend to accept the practice of homosexuality. This however is a dangerous one. With the LGBTQ+ movement leading the charge, It wishes to re define the meaning of marriage, Family, Sex and the difference between man and womanhood. Firstly, With the subject of marriage. Within our Western culture, For centuries, Marriage has always been seen as an institution for a man and women to raise a family. To this day it is still the best way to raise children hands down. Now apart from a very few exceptions a same sex marriage can not provide that for obvious reasons. Upon the subject of sex, Gay sex can not be seen as moral as it does not allow the procreation of children. One cannot just separate procreation and pleasure as otherwise sex becomes meaningless and casual. The effects of the sexual revelation can be seen today, With the rise of STDs, Teenage pregnancy, Rise of abortions, Pornography, Sex trafficking and the list goes on. Moreover it is visible within LGBTQ+ organised Pride parades that sexual deviancy is promoted by a visible few, Which then increases the number of problems that I have already stated. However it must be understood that one should NEVER hate or hurt anyone who commits these acts of sexual disorder, As heterosexuals can be just as bad, But we should help correct each other with compassion."}, {"title": "Nothing is wrong nor right", "body": "We live in a modern society were we consider things to be correct or incorrect. However, This modern system is biased towards many things. Whereas humans have adjusted to these things in a certain manner to determine the role of an object. For example; A tooth brush. It can be used for many different things, However most consider it to be used as a utensil to clean the inner caverns of our mouths. Moving towards this topic, Sexuality is but a biased thing in our modern society. To conclude, Nothing is correct or incorrect. It is just a manner of how we as a modern society consider things."}, {"title": "How do you know your gender and sex don't match?", "body": "A person came to our school to do a presentation on the LGBTQ+. She explained that if a person doesn't feel that their gender matches the one they are assigned at birth, We can change our gender. But the thing is, How do you know that your gender and sex don't match? Is it simply that you want to be another sex, For example, You're a girl and you really want to be a boy."}, {"title": "People are people, Their choices are either net good or bad.", "body": "There isn't any grey area where a person can openly throw out morality in one area so long as they pay it off in other areas. Each decision individually is tested against the limits of morality, And if you fall outside those limits you risk being burned. People know beforehand the consequences of choosing a deviant sexual relationship (they could choose any). It doesn't have to even be homosexual. The worst part of a homosexual relationship is that you bring another person down to your level … like using (drugs) with another person. In doing anything with them you empower them and make them feel like its normal and ok. Then that sentiment sticks with them like any addiction. Hell, People with addictions even think sometimes they were born that way, Predestined to use, As if they have nowhere else to turn. Its all just a denial to help justify to themselves what they are doing. The problems are self evident:1) Over emphasis on sexual pleasures … ones that can never amount to offspring as it was meant to (you can buck Darwinism if you don't like that). 2) you deprive yourself the true balance of having a hetero relationship. 3) You open yourself up to throwing out other good guidance from sources such as the bible, Just because it doesn't reflect the way you want to be. 4) You act against the idea that people are unique in that you have determined that there is no opposite sex partner for you. (prison stats clearly demonstrate that homosexuality is situational based … or worse that if people are born this way that they are also predisposed criminals)   Predisposition for crime though might support what I said above in all the other points, Though im not saying that they have that at this point. 5) Exhibit selfishness in that they are willing to walk such a hard uphill battle against nature for their own sexual pleasure. Or the fact that they don't walk what they perceive to be an even harder line by following through with the morally right path that's been presented to them. Just all round its a very belittling practice. It doesn't buy any respect for the human race, It makes us look like animals. It demonstrates that we can't handle emotions or look past our basic instincts. Its primal and disgusting, As primal and disgusting as violence against innocents is. Everytime I see it it makes me lose faith in mankind. Worse yet seeing it propped up by a morally flawed society as if a social norm."}, {"title": "LGBTQ+ is spreading the wrong message", "body": "Young children in elementary school are now being exposed to the LGBTQ community. This is dangerous, Manipulative, And damaging to our society. Children as young as 7 are claiming that they are trans, Gay, Lesbian, Etc. This is ridiculous. These children are far too young to know what gender they like or if they are in fact the opposite gender. A 7 year old should have no attraction whatsoever to another person in terms of a relationship, Serious or sexual. However, The LGBTQ community and their message spreading is enabling our youth to learn about these topics. When these children are influenced, They listen, As they are easily manipulated. This is turning people who may not be LGBTQ into members of the community. If we want a generation of delusional and wrongly influenced youth, Then yes, LGBTQ is great. However, That is not what we want, And the LGBTQ community stands in the way of a community that is born of free choice, Influencing children at such a young age."}, {"title": "But only the movement", "body": "On their own the people in these groups aren't too bad but the movement is the problem. Most LGBTQ+ people just want to get on with their lives without worry. The LGBTQ+ movement however undermines that by trying to force society to submit to their ideology. The movement (which btw is made up mostly of non-LGBTQ+ people) attacks people for the most trivial of mistakes. Trans woman: how dare you call me sir I'm gonna have a mob beat you up and then have you arrested. Or something similar."}, {"title": "I don't hate them for their sexuality, Just their actions", "body": "I don't hate anyone for their sexuality. They could be sexually attracted to trains for all I care, Honestly. I'm a Christian and I believe Love Is Love. That being said, The LGBTQABCDEFG community has gotten out of hand, Especially within these past couple of years. They are primarily responsible for \"cancel culture\" a situation that affects even small people just scrounging for money as artists and such. They are obsessed with only pushing their agenda. . . Their morals. It sucks. I had a Christian friend who literally stopped accepting herself as an LGBT individual because of how they treated our religion."}, {"title": "My rights are gendergay", "body": "It's wrong to deny me my LGBTQ rights. Gender bigots have gender hatred, Which means that I can't express my rights. I need to express myself through sex, And I'm not going to let Trump fukcs tell me I can't. My rights are gendergay, And your rights are pathetic. People are trying to ignore my rights to genderqueer sex. They other me, And instead talk about less important issues like the environment and poverty. What use is not being hungry if LGBT folk aren't validated?  I demand my gay rights, And people are just going to have to get used to other issues like low wages and climate change until my rights to sex are validated. Because genderqueer validation is the future."}], "con_arguments": [{"title": "No being LGBTQIA+ is not wrong", "body": "Lets divide this into three parts. Those who feel same-sex attraction/love -No one can choose who they love or like, And so for their feelings the cannot be held accountable for a wrong deed. And love is love, Attraction is attraction, Its all equal, Regardless of who its towards. Those who are transgender or non-binary -Have a medical condtion called gender dysphoria that makes them feel like their body and pronouns are incorrect ones, So sometimes the adjust to feel better. This helps them be happy and fufilled - a way to cope with their conidtion, Which is never wrong as it harms none. Intersex people - A biological condition where one is born with charasterics of both sexes. A way you are born, Not something you can control, So not wrong. Asexual/Aromantic People - People who cannot feel attraction and/or romantic love towards others. A way you are born, And not wrong at all."}, {"title": "I can't understand why this is 50/50", "body": "I'm not going to say much on this argument because to be quite honest I don't have the energy to go over the things I've said to many a homophobe, But seriously, I don't see what the issue is with the LGBTQ+ community? If you don't agree with it, That's your opinion and up to you and no one else to decide, I get that and I'm not going to try and change your mind. But how does that give you the right to decide whether someone else's sexuality is 'wrong'? Oh yeah, It doesn't. I'll finish this off with a quote I saw:\"Straight marriage and gay marriage are like bras and bikini tops - both exactly the same thing, But only one is socially acceptable. \"I couldn't have put it better myself."}, {"title": "Are we still talking about this", "body": "Ok, I admit the Bible has some condemnation of gays, BUT the Bible is not the universal code. You choose to follow it, And you can't force others to, And the MORE IMPORTANT part of that scripture is that you have to be nice and treat your neighbor like you treat yourself."}, {"title": "People should be allowed to be whoever or whatever they want.", "body": "You can't control what people feel- if they are lesbian, Bisexual, Transgender, Queer or identify as another sexuality than that is what they are, No question. If someone told you that you couldn't be straight you would be outraged, So why is it different when you're telling people they can't be LGBTQ+? The Bible, In this sense, Is outdated. People are what they are and you just have to accept that."}, {"title": "Is LGBTQ+ wrong?", "body": "No. Why would LGBTQ+ be wrong? Why is it wrong to have a certain sexual alignment if you do have the same criticisms when being heterosexual? Why should a person receive punishment or negativity that they did not choose. If you were to argue that people do choose their sexuality, Then still, Why is this wrong of them? Or is it simply that people wish to abuse those they do not agree with? Do what you want, Be attracted to who you want, Just don't force me to do the same."}, {"title": "It doesnt matter", "body": "Let people do whatever they want. This is how the world works now. Being a homophobe is as bad as being racist. Not everyone believes in your f***ing religion so stop forcing them to believe what you believe in. It doesnt even affect you. If you have a problem with your kids being gay then, Don't have kids. This is how the world works now"}, {"title": "Let people do whatever the heck they want, It doesn't affect you.", "body": "Let people do whatever the heck they want, If individuals want be LGBTQ+ movement is simply trying to get people to becoming accepting. Individuals deserve legal rights just as a heterosexual would. If you're going to bring the bible bs into this, Then you bring religion directly into politics. . . Doesn't it say somewhere in my constitution there is \"a separation of church and state? \"."}, {"title": "No it isn't.", "body": "Love is love. You cannot tell someone who they can and can't love. People don't realize that sexuality isn't something that is controllable or chosen by the person. It has to do with an imbalance of chemicals in the brain. Just like depression or other disorders, And no I'm not saying that homosexuality is a disorder. Depression is caused by an imbalance of chemicals in your brain, Where there is a significant lack of dopamine (also known as the \"Happy Hormone\") being produced in the brain. Love and accept people for who they are!"}, {"title": ". F, V s, Dmnfvdsmnf, Nvsd, Nfmv, Mnsfv", "body": ". . . . . . . . . . . ;d, Ls, D;l kmasdk naoisdn poiwnepi pqwoief niquen fpoiqn poiqnprioq pwrif pj lvj nfv ndf vn fljv dlkfj vlsjdf vknsdf vmnsd, Fmnv s, Nmfv, Mnf, Mnds f, Mvnsd f, Mnv sd, Fmn s, Mdnf, Smndf v, Msndf v, Mns df, Mns f, Mn s, Fmn, Smndf, Msndf, Mns f, Mns, Fmn s, Fmn, Smnf, Mns f, Mns"}, {"title": "I ate a dog, Here's why", "body": "I didn't eat a dog. (Or did I? ) The bible said nothing about   Jesus wanting to burn alive all gays, Last time I checked he just didn't like people lying, Killing others, And not being nice to each other. I don't even believe in Jesus or any \"God\", But I do in fact know that Jesus did not say to burn all gays. . Do you really think that would pop up in his head whilst he was writing down some random thoughts on a piece of paper witch is now called the \"Bible\"? Yeah I wouldn't think so. . I'm not gay, I don't think being gay is good or bad it's just GAY (I'm on the NO side because the yes side is mostly talking about burning alive gays and stuff so yeah, And I disagree with burning alive humans)"}]},
{"topic": "Kirk will always be better than Picard!", "category": "TV", "pro_arguments": [{"title": "Homeworld: Cataclysm & Kirk continued", "body": "The article continues :\"This \"miners becoming warriors\" sub-plot is reflected in gameplay where players link Acolyte fighters together to create corvettes, Repurpose asteroid tugs into ramming frigates, And upgrade their initially defenseless mothership into a heavily armored warship with a massive siege cannon. These unique ship types and upgrade paths lend themselves well to the different missions of Homeworld: Cataclysm, Featuring scenarios where players must scavenge weapons from ancient wrecks, Infiltrate enemy facilities with mimic craft, And research ways to counter and destroy the warped spaceships taken over by the Beast. Homeworld Cataclysm Has A More Character Driven Story Than Previous GamesHomeworld_ Cataclysm Homeworld_ EmergenceThe storylines of Homeworld 1 and Homeworld 2 are plot-driven rather than character-driven, Focusing on the beauty of outer space and the sleek lines of the spaceships players can build. Karen S'jet, The protagonist of the Homeworld franchise, Even goes so far as to cybernetically fuse herself with the mothership in both Homeworld 1 and Homeworld 2, A metaphor of sorts for how the spaceships are the true stars of the show. The story of Homeworld: Cataclysm is tense, Horrific in tone, And smaller in scale compared to the sweeping, Grand hero's journey of the original Homeworld 1, And as a result, Manages to have more intimate moments of character growth. The Bentusi, Living starships and traders who occupy the \"Wise Old Mentor\" archetype in Homeworld 1, Reveal a more fallible, Human side to them in Homeworld: Cataclysm, Fleeing their responsibilities out of fear of being consumed and enslaved by the Beast. The Fleet Commander of the Homeworld: Cataclysm mothership, In contrast to the stoic narrations of Karen S'jet, Goes through a very emotional character arc, Starting off as the gruff captain of a mining vessel horrified at the assimilating behavior of the Beast, Growing into a hardened warship captain, And from there into a charismatic leader who talks the Bentusi traders out of abandoning the galaxy with an impassioned speech worthy of Captain Kirk. Even the villainous force known as the Beast has a richness of character, Cruelly interacting with players using the memories and voices of the crews they've devoured, Their attempts at manipulation and strategy hindered by a childlike inability to see other lifeforms as anything but food. All in all, Homeworld: Cataclysm was ahead of its time in many ways, Pioneering gameplay innovations adopted by Homeworld 2 and introducing a character-driven sci-fi horror story that foreshadowed future games such as Dead Space. As the developers of Homeworld 3 work on the next chapter of the Homeworld saga, They could do worse than to use the Homeworld: Cataclysm spin-off as a benchmark of game design to match and surpass in both quality and novelty. \""}, {"title": "Homeworld: Cataclysm & Kirk", "body": ". . . The website Screenrant. Com   on May 18, 2021 has an article headlined \"Why Homeworld: Cataclysm May Be The Most Innovative Homeworld Game\"Of all the Homeworld outer space RTS games, Homeworld Cataclysm, A third-party spin-off made by the Barking Dog Studio, Might be the most innovative. BY COLEMAN GAILLORETOHomeworld_ Cataclysm Homeworld_ Emergence Mothership Kuun-LanRecent development updates for the space opera RTS Homeworld 3 have renewed people's interest in the Homeworld games, Famous for combining the mechanics of real-time strategy with three-dimensional starship combat and the exploration of vast zones of space. The most innovative game in the Homeworld franchise, However, Is arguably the most obscure. Homeworld: Cataclysm, A spin-off game by Barking Dog Studios, Introduced new gameplay mechanics and spaceship designs to the series along with a distinctly character-driven story containing heavy horror elements. In Homeworld 1, A crew of space colonists in a great mothership embark on an epic journey to Hiigara, The lost planet of origin for their species, All while being pursued by the fleets of the galactic empire that exiled their ancestors to the edge of the galaxy. In Homeworld 2, The Hiigarans must defend their re-claimed home-world from invading space nomads while unlocking secrets hidden away in the ruins of an ancient precursor civilization. In the gameplay of both Homeworld titles, A banana-shaped mothership hyper-space jumps to new regions of space, Harvests local resources, And slowly assembles a massive star-fleet of fighter-craft, Corvettes, Frigates, And capital ships.  Homeworld_ Cataclysm Homeworld_ Emergence Mothership Kuun-LanHomeworld: Cataclysm (released in 2000 and currently available on GoG under the name Homeworld: Emergence) takes place between Homeworld 1 and 2, Focusing on a clan of space miners who accidentally unleash a flesh-consuming, Ship-corrupting contagion called the Beast, Then convert their mining vessels and equipment into weapons of war to hunt down and destroy the monster they set free. Homeworld: Cataclysm introduced several useful quality of life features to the original Homeworld's gameplay, Such as the ability to speed up time and removing the need for fighter-craft to refuel; it also took Homeworld's base premise in interesting new directions.  Homeworld: Cataclysm Mixed Up The Formula Of Ship Design &amp; TacticsHomeworld_ Cataclysm Homeworld_ Emergence Capital ShipThe protagonists of Homeworld: Cataclysm are the miners and engineers of Kiith Somtaaw, A lower-class clan of the Hiigarian people who seek their fortune among the stars. After tampering with an ancient piece of space wreckage and unleashing the Beast contagion (similar in behavior to the Protomolecule from The Expanse), Kiith Somtaaw (and the players, By extension) are forced to modify their mining infrastructure into deadly weapons of war. \""}, {"title": "Space Farce & Kirk", "body": ". . . . On May 12, 2021 the website   rt. Com has an article headlined \"Space Farce! The US Space Force sets out its mission to achieve 'digital dominance' in the universe - &amp; becomes a cartoon parody\"   by Scott Ritter, Part of this article says :\"To boldly go…? Space Force was envisioned by its supporters to be a forward-looking agency which would seek innovative solutions to emerging problems so that the US would remain ahead of any potential adversary. This notion was taken to extremes by some supporters, Such as Texas Senator Ted Cruz, Who opined at a Senate hearing on the subject that “[p]irates threaten the open seas, And the same is possible in space. In this same way, I believe we, Too, Must now recognize the necessity of a space force to defend the nation and to protect space commerce and civil space exploration. ”Cruz later clarified that he was talking about the threats from China and Russia, But the fact of the matter is that, From its inception, The Space Force has had a cartoonish aspect about it. While its motto, “Semper Supra” (Always Above), Is memorable, So, Too, Is the Space Force logo, Which to many space aficionados looks as if it were lifted from the popular television show and movie franchise, Star Trek. When Space Force is talked about, One cannot help but hear the voice of William Shatner – Captain Kirk – speaking the immortal phrase, “Space–the final frontier. . . ” or Buzz Lightyear (from Pixar’s Toy Story) shouting “To infinity and Beyond! ”   Other Star Trek references can be found in this article, The rest of this article can be found online"}, {"title": "2009 Star Trek Surround Sound", "body": ". . . On May 17, 2021   whathifi. Com   has an article headlined \"19 of the best film scenes to test Surround Sound\" by Becky Roberts, Dan Sung &amp; Mary Stone  A scene from the 2009 Star Trek film made the list and it says :\"Star Trek (2009) - chapter 5\"We’ve seen it a gazillion times by now, But the scene where Bones keeps injecting Kirk with vaccines, The reveal of the USS Enterprise and the ship going into warp speed remains one of the best and funniest moments of JJ Abrams’ rebooted Star Trek. It’s also a magnificent test for your home cinema system. You should be able to feel the height and movement of the ships that fly over the Starfleet students as they bustle about in the hanger; the change in scale and atmosphere when Bones and Kirk move to a smaller room; hear the little beeping, Blinking noises inside the Enterprise; and the deadpan humour in Captain Pike’s gravelly voice. The moment of truth comes when Michael Giacchino’s stirring score fills the entire room and reaches a beautiful flourish when you first see the Enterprise. The soaring music should end with blaring horns and a moment of awe as the pristine starship is finally revealed. And when it hits warp speed, Your system should be delivering that gut-punching, Precise sound effect with layers of deep, Taut bass. If you're spine's not tingling after that lot, It's time to find some new home cinema gear. \""}, {"title": "From the Washington Post. . .", "body": ". . On May 10, 2021 an article on washingtonpost. Com is headlined \"Why Can't More Straight Men Say 'I Love You' to Each Other\" by Ken Budd Part of this article says \"In some ways, We’re odd-couple friends. I’m quasi-atheist. An introvert. Todd is outgoing, A hugger, Someone who shares his feelings. I often feel like a Vulcan — the reserved Mr. Spock to his hold-nothing-back Captain Kirk. And yet, As Todd noted recently, We’re so comfortable with each other that it’s hard to remember when we weren’t. The dearth of male role models who say “I love you” doesn’t apply just to our fathers, Brothers, Uncles and friends. It permeates the entire culture. Shrek and Donkey never said “I love you. ” Neither did Hawkeye and B. J. Of “M. A. S. H. ” Or Harry Potter and Ron Weasley. The dearth of male role models who say “I love you” doesn’t apply just to our fathers, Brothers, Uncles and friends. It permeates the entire culture. To my knowledge, None of the memorable male duos in TV and movie history — Han and Luke, Butch and Sundance, Kenan and Kel — have expressed their on-screen love. If they do, It’s a punchline: the silliness of Dr. Evil cooing “I love you” to Mini-Me; Wayne Campbell’s awkward response to a buddy’s “I love you” in “Wayne’s World. ”Even on “Sesame Street, ” eternal roommates Bert and Ernie don’t say “I love you. ” Bert has sung of his love for pigeons, And Ernie has sung about his love for his toes (and his rubber duck), But they have not, As far as I can find, Expressed their love for each other. (The show’s producers could not confirm or deny that either character had ever informed the other of his love. ) They sing a song called “But I Like You, ” but c’mon. It’s a cop-out. In the final season of “Seinfeld, ” a suddenly sensitive Jerry repeatedly says “I love you” to a highly uncomfortable George. “Oh, Please don’t tell me you love me again, Jerry. I can’t handle it, ” he says to laughs. Kramer is more responsive — “I love you too, Buddy, ” he says — but words like “buddy, ” “man” or “dude” are a common guy trick to soften the emotional impact. (Even Todd will frequently say, “I love you, Pal. ”) The 2009 comedy “I Love You, Man” took this to new cinematic heights. In a wedding scene, The groom, Played by Paul Rudd, Exchanges eight “I love yous” with his best man, Including such gems as “I love you, Bro Montana” and “I love you, Broseph Goebbels. ”The rest of this article can be found online"}, {"title": "Two Great Plot Devices", "body": ". Fun Fact   Locusmag. Com has an article in May 16, 2021 by Paul Filippo headlined \"Paul Di Filippo Reviews The Godel Operation by James L. Cambias\" about the Sci-Fi novel The Godel Operation released in May 2021, Part of this article says about the software weapon The Godel Trigger mentioned in the novel that :\"It’s a software weapon that can harm only AIs: a set of paradoxical axioms that can wreck the most sophisticated machine intellect when exposed to them. (Here I detect Cambias having fun both with Monty Python’s “The Killing Joke” and the way Captain Kirk was always frustrating rogue intelligences\" Kirk is compared to the Monty Python comedy sketch The Killing Joke aka \"The Funniest Joke in the World\" also called \"Joke Warfare\" &amp; \"Killer Joke\""}, {"title": "Captain Kirk Quick D-Livery, Star Trek Hot Wheels", "body": ". . . . Startrek. Com has an article headlined \"10 Collectible Star Trek Hot Wheels No Collection Should Be Without\" the article says Vroom Vroom vs. Pew Pew! BY JOHN DEQUADROSMAY 10, 2021    \"While the 1960s may have been one of the most divisive decades in world history, It also saw a man set foot on the moon and an automotive industry dominated by Detroit's Big Three. As such, It should come as no surprise that few things defined the positive side of this golden age like Star Trek and Hot Wheels. Both were birthed alongside bell bottoms and Beatlemania, Each looking toward a brighter and better future. A future that would one day hopefully see us set aside our differences and use advancing technology to better our world before eventually taking to the stars. And yet, For all that parallelism, It would take four decades to bring them both together! That said, We live in a world where scale sized Star Trek ships are now a thing. Since 2009, Mattel has churned out numerous miniature models based upon some of the most iconic ships to ever explore the final frontier - along with more than a few unique oddities and one-offs. And fans just can't seem to get enough! But, What do you expect when two of the world's most collected brands merge together to create something so perfectly logical? This list of ten Star Trek Hot Wheels may not include items as coveted as a 1974 Magenta Roger Dodger. Nor may they be as special as the 1977 Z-Whiz Datsun. However, When it comes to shrinking down the majesty of Starfleet, There are no finer wheels on the road. . . #10 - Captain Kirk Quick D-LiveryStar Trek: The Original SeriesLet's kick things off with a vehicle created in celebration of Star Trek's 50th Anniversary. Part of the Pop Culture vehicles assortment released in 2016, It takes the quirky 1/64 scale Quick D-Livery model first introduced back in 2013 and gives it a futuristic makeover complete with a metalflake paint job, Real Rider tires, And two huge portraits of Captain James T. Kirk adorning both sides! The retro chic 2023 VW Microbus inspired design hearkens back to the days of tie dye and turtlenecks, While at the same time offering up enough modern flair to fill a starship! It has now been about five years since the Captain Kirk Quick D-Livery model first hit stores, So you'll need to do some searching on the secondary market if you'd like one of your own. Originally, They were priced between $4. 99 - $7. 99, However nice examples still packaged on the original blister card are fetching upwards of $25 nowadays. Check Amazon, EBay and Facebook Marketplace if you must, But may I also recommend you visit the Hot Wheels Collectors community? Sure, You might snag a deal on these other sites, But sometimes it's just better to deal with fellow collectors if you have the option. \"   The rest of the article is online"}, {"title": "Senator Jennifer McClellan says Kirk!", "body": ". . The website bluevirginia. Us has an article headlined \"Kellen Squire’s Interview with Jennifer McClellan: “the whole core of my being is I’m here to solve problems and make people’s lives better”By Blue Virginia - May 16, 2021   the article says:Great job by Kellen Squire and thanks for interviewing the Democratic candidates for statewide office. Here’s Kellen’s interview with gubernatorial candidate Sen. Jennifer McClellan, Cross-posted from Daily Kos. KELLEN SQUIRE: Senator, Thanks for taking the time to talk today. Real quick, Before we get started, I understand you’re a Star Trek nerd, So I have to hit the low-hanging fruit. Kirk or Picard? SEN. JENNIFER MCCLELLAN: Kirk! I actually took a “Which captain are you? ” quiz, And I’m Kirk. KS: Heh, Well, I’m a huge Star Wars nerd, But I know you’re busy, So I’ll save the “Imperial Star Destroyer versus Enterprise-D” or “Picard versus Thrawn” debate for next time, Maybe\" the rest of this article can be found online"}, {"title": "More about Garrus & Kirk", "body": ". . . Gamingbolt. Com   in 2013 had an article headlined \"99 Badass Heroes In Video Games\"   the article says:The most memorable and toughest heroes in video games. Rohan Philip in FeatureSlider On September 22, 2013     Page 42 of 99 59. Garrus Vakarian (Mass Effect Series)\"Garrus Vakarian is to Commander Shepard, Like what Spock was to Captain Kirk, In Star Trek. They both shared an amazing friendship and went through hardships. Garrus is a natural leader and fought side by side with Shepard. He is one tough Turian and is an excellent sniper and warrior. He is one of the most loved characters in the Mass Effect universe. \""}, {"title": "Mass Effect, Captain Kirk Tradition, Part 3", "body": ". . . The article lastly says\"Almost everyone else leaves you or messes with you at some point. But no matter what he's doing, Garrus is always ready to drop everything and charge into the hell of Shepard's choosing, At their side, \" says Prolix. \"He's always there for you. He's a constant lamp in the fog of war, And he clearly feels the same way about Shepard. That's special. While other crewmates are always getting themselves into trouble and needing to be bailed out, Or making demands that of course go terribly sideways, Or starting fights, Or endlessly hitting on you, There's never drama with Garrus. \"When you're Femshep and you romance him, That dynamic kind of puts them in this role of the 'Normandy Mom &amp; Dad' in Mass Effect 2 and 3, Which is adorable also. \"(Image credit: BioWare)Of course, None of this gets around the fact that Garrus also has a granite exoskeleton, Flapping, Unseemly mandibles, And a massive scar carved across his face. Mass Effect is a horny videogame, And its universe has no shortage of sexy aliens in the Captain Kirk tradition, But Garrus does not fit that archetype. He wasn't romanceable in the first game, But Liara, Who belongs to the Asari—a species who've been given lore justifications for being extremely hot—absolutely was. As far as Dawn is concerned, Garrus's scarred beak is part of his appeal. He wouldn't be the same without it. \"I know I’ve basically gushed over the emotional and personality aspects of Garrus Vakarian, But that voice, Those scars? I’ll take one Turian over a hundred Asari any day of the week, \" she says. \"Those scars are pretty cute too, Totally drives the ladies wild. \"So good luck to Garrus Nation, As their husband finally returns from war. Perhaps someday BioWare will retcon the end of Mass Effect 3 completely, And we can witness the salad days of Garrus and Shepard: both of them retired and chilling beyond the outer rim, With no simmering interpersonal feuds tearing up the Normandy chemistry. Until then, We will always have those first three games, And the only man we could ever count on. \""}], "con_arguments": [{"title": "Buy Adderall Online", "body": "Buy Adderall Online Without Prescription in USA | Adderall Overnight Delivery in US and CanadaAdderall is used to treat attention deficit hyperactivity disorder - ADHD. It works by changing the amounts of certain natural substances in the brain. Amphetamine/dextroamphetamine belongs to a class of drugs known as stimulants. It can help increase your ability to pay attention, Stay focused on an activity, And control behavior problems. Buy Adderall online from here - https://ambien10mg. Org/product-cat/buy-adderall-online/Visit Ambien Pharmacy: https://ambien10mg. Org/ adderall, Buy adderall online, Adderallxr, Adderall 10mg, Adderall 20mg, Adderall 30mg, Medicine, Usa, Adhd, Sleep disorder, Insomnia, Anxiety"}, {"title": "“Always” is absolute", "body": "Let me start by saying that i prefer Picard over Kirk, Both for his acting and the way the character was portrayed. And I’ll admit I’m biased having watched the next generation first. But all of that is irrelevant to the question as I see it. “Will Kirk will always be better than Picard” first is framed in a way that Kirk is better than Picard to begin with. Second I am hesitant to believe anything can and will “always” be. There are exceptions. . . . Math being a prime example."}, {"title": "This is the worst debate in the entire website", "body": "Its just one guy spamming copy pastes he found on the internet which aren't even arguments for the debate. This dude needs to get a girlfriend or something or go outside get a job etc. Like seriously what is your purpose dude? Probably not even a real person but rather a robot programmed to spam random things it found"}, {"title": "I have come back", "body": "The yes side is still being massively spammed, I need reinforcements guys. Somebody spam the no side to counter this spam, It would be what Picard wanted. Kirk is a f***ing loser and you all know that. TNG is the best series and has the best crew including Picard. F*ck the Kirk spammer"}, {"title": "The yes side is spammed by the same person so Picard is better", "body": "Picard is just way more recognizable and is from the better series so he wins. End of story End of story End of story End of story End of story End of story. Picard is way more respectable and has better story in the series. Also he has better memes like the famous facepalm. The spammer on the left over there is a fake star trek fan"}]},
{"topic": "We should Institute a death penalty for homophiles and transexualists.", "category": "Politics", "pro_arguments": [{"title": "I hate gays", "body": "The homosexual and it’s consequences have been disastrous for humanity. The LBGT community are a bunch of degenerate hedonistic pathetic excuses for humans. What does being Gay have to offer to a person’s lifestyle? Nothing. They inisist to go against nature and giving in to their mental illness. They can’t even have children. They are f***ing useless."}, {"title": "Both are hostile ideologies.", "body": "Both transexualism and homophilia are dangerous concept invented by the cultural neo-marxists. Both are demonstrably mental illnesses that serve to weaken and degenerate our nations and peoples. Homophila spreads sexually transmitted diseases and lessens population growth. It's going to the point now where they are demanding increasingly higher privileges for themselves at the cost of the majority population. We cannot allow this cultural marxist madness any longer!"}, {"title": "We should do it only if they are open about it and refuse to stop", "body": "I think that a death penalty would be prudent in the case that homophiles and transexuals who are openly promiscuous are a degeneration of the sanctity of the public and society as a whole. No we shouldn't go on a witch hunt of mentally ill folks who can't control their lust or emotions but we should oppose normalizing it by any means necessary"}, {"title": "It is a sin.", "body": "Homosexuality is a sin, Just like murdering, Stealing, Lying, Cheating on your spouse, Etc. And according to the scriptures, Anybody who sins against God will not inherit His kingdom. So why are we supporting this behavior? We are doing many, Many people a disservice by supporting, No, ENCOURAGING a sinful lifestyle. Would I go as far as to say that we should institute the death penalty for them? No, But there should be organizations in place to help these people, Not encourage sin."}, {"title": "Not exactly true, But close", "body": "The culture of both is completely degenerate and has no benefit to society. They should not be killed for being that way, Just if they won’t shut up about it. It’s fine if they do it in secret, But they just get so pushy about it and how everyone has to agree with them. That’s when they cross the line."}, {"title": "It is unbiblical", "body": "Throughout the Bible, Homosexual behavior is expressly forbidden. Anyone found to have committed a homosexual act was to be put to death. Simple as that. The Bible also forbids dressing as the opposite gender. No ifs buts or loopholes. Homosexuality and transsexualism were NEVER part of God’s original plan and never will be. It is simply a product of sin and imperfection. Soon enough, God will end homosexuals and transsexuals who do not repent. In the mean time, Why not get rid of some ourselves. Not because they ARE gay or trans, But because they choose to act on it and not be normal."}, {"title": "Bro like come on, They are transformers, Remember Chicago?", "body": "I hate trans people, They probably smell from all the hormones they secrete and they all look weird, You ever walked and send a tranny and felt safe, Hell nah. We need a street cleaning service that just takes care of that crowd alone. Imagine the medicare they use from taxpayer money to pay for those surgeries. I hate jews."}, {"title": "God supports straight", "body": "God only supports straight people only we should just kill all the gays in this world because straight people have turned this world into the greatest world ever I have seen nothing but harm from gay people all around the world I think that it is about time to turn this world back into a straight only world"}, {"title": "They need to be dead", "body": "I would rather live in a straight world rather than a stupid dumb gay world we live in right now we should just give a death penalty to all the gays in this world so that way we can protect this world and of course stop gays from turning this world into dangerous"}, {"title": "Gays are too dangerous", "body": "Gays are evil dangerous and of course they caused great damage to the world like right now the gays have ruined this world and they should have to be punished for that we should punish all the gays with harsher punishments in order for this world to become straight only"}], "con_arguments": [{"title": "A death penalty can only be justified if there is an exceptional amount of harm being inflicted. Neither group mentioned meets this standard.", "body": "The death penalty is typically reserved for the most heinous of crimes. Murderers are typically those who receive the death penalty. In this instance, The murderer has inflicted a massive amount of harm against an individual by ending their life, And against the individual's loved ones by depriving them of that individual. In other words, Only when the harm caused by an action is equivalent to taking a life should a death penalty be considered. It goes without saying that sexual practices or gender identity can never fulfill this standard. Nobody dies as a result of being too close to people who are having gay sex. Nobody dies as a result of passing by a transgender person in the street. The opposition states that these are \"dangerous ideologies\" perpetuated by \"cultural Marxists\". This is patently false, As gay sex has been observed both in nature and in societies that developed before Karl Marx's writings or any of their derivatives. The statement that gay sex \"spreads sexually transmitted diseases\" is irrelevant, As any kind of sex is capable of spreading disease without proper protection and testing. The claim that it \"lessens population growth\" is similarly useless, As population growth reduces in response to a vast number of other variables, Most notably education and standard of living. Blaming gay people for a decrease in population growth arbitrarily ignores the other, More substantive influences. The claim that either gay or transgender people are \"degenerating the nation\" is entirely without substantiation. The opposition does not care, Of course, Because the intent is only to latch onto a convenient scapegoat for the systemic failures of late-stage capitalism. The claim that sexual and gender minorities are grasping for privileges as the cost of the majority is just as unfounded as the rest. The only \"privilege\" I have ever seen agitated for is the privilege to live without the threat of violence or oppression. Clearly the opposition does not respect the right of other people to live as they see fit. It is my opinion that those the opposition threatens should respond in kind. A tolerant society can only exist if those that would threaten it with autocracy and genocide are suppressed and expunged with the same brutality they reserve for their scapegoats."}, {"title": "A thousand times no", "body": "I really don't get what is so hateable about gay people. We're not hurting anyone, We're just being our fabulous selves. The death penalty for any crime is barbaric, But being gay isn't even a crime. Y'all can leave your baseless hate elsewhere, As it has no place in a society with any common sense whatsoever."}, {"title": "This will backfire on you", "body": "Sven people like you are why Christians will be hunted down. And do not tell me you are the salt of the earth because you have no flavor. You can be irritating all by yourself without a hint of godliness. Oh boo hoo my Starbucks cup doesn't say Christmas lets make a dramatic scene. Oh my gosh I see a dude with another dude lets stone them on the spot. They are going to torture Christians and persecute them like never before. Sven you are a stumbling block. You are not going to heaven and you block other from going into heaven and you are the reason why Gods good name gets insulted by the heathen."}, {"title": "Absolutely no way", "body": "I just don't understand why anyone would think that we should institute a death penalty for homosexuals and transsexuals. The LGBT community deserves rights just like anyone else. Being gay is not 'unnatural' as it occurs in nature. It is homophobic and insulting to say that we should ever do such a thing. This kind of punishment has no place in our society. LGBT people did nothing wrong."}, {"title": "Homophobia is gay", "body": "You cannot change a gay person. Even if being gay was a choice, So what? People choose to be an asshole, And they still marry. You complain about children being sexualized from lgbt, Yet explain all those beauty pageants for cis girls. Straight people can still have HIV, And there are several straight pedophiles out there. Just leave them alone, They are not harming you in any way."}, {"title": "Gays and transgenders have the right to be!", "body": "Besides, I disagree with the death panelty plain and simple. Honestly, I can't believe homophobes and transphobes still exist in this world! I thought it was 2020! What happened to progress? When will conservative ideologies finally be illegal like they should have always been? There is no reason to fight progress."}, {"title": "Only the insane, And evil, Could support this", "body": "First of all, The Death Penalty is reserved for serious crimes only. Second, LGBT people who simply want to live their lives and not be bothered is HARDLY a serious crime. And the people on the other side saying \"Yes\", Are themselves depraved sociopaths, Devoid of morality. I'm grateful that literal human excrement like them are not running things."}, {"title": "We are equal.", "body": "First of all I don’t agree in general with the death penalty. I do not see why homosexuality or transsexualism should be a problem, Other than for religious views, Which I disagree with too, Because God says he loves people no matter what. Thus people are equal and no one deserves to be disrespected just because you do not agree with their lifestyle."}, {"title": "Obviously not wtf", "body": "Any christian supporting the death sentence on people that as you say choose it do not deserve to die. That is so contradictory. God made life and it is a gift so killing people? What on earth. Even if you argue that they are degenerates, They are not killing others and the only one getting harmed is you with your seriously flawed and backwards views. Get a life! I can't believe 40% of people here agree to killing innocent people. If it's a mental illness help them! If it's a choice or a lifestyle know that we as God's children have free will and that does NOT mean killing them. This debate is so messed up."}, {"title": "N o you idiot", "body": "You fool. You absolute buffoon. You think you can challenge me in my own realm? You think you can rebel against my authority? You dare come into my house and upturn my dining chairs and spill coffee grounds in my Keurig? You thought you were safe in your chain mail armor behind that screen of yours. I will take these laminate wood floor boards and destroy you. I didn’t want war. But i didn’t start it."}]},
{"topic": "Do you agree with the Black Lives Matter Movement?", "category": "Society", "pro_arguments": [{"title": "BLM or if not you are racist.", "body": "Isuport it because it is a fight of a huge minory with has suffered a lot and they just want to be the same as everyone as we are all humans. Also it is a fight between police with are corrupt and illegal with the only thing they do is to abuse of the power they have with everyone."}, {"title": "Only the stupid could disagree", "body": "I won't bother pointing out the obvious flaws in the \"statistics\" of the other side of the argument. Makassar already did that (seeing a coherent argument on this site was a nice change of pace). However it seems necessary to point out that every flaw pointed out was literally right in front of their face. They clearly aren't reading the articles where they found these statistics. They're not even looking at the entire chart as both the articles and the charts point out everything Makassar said. When you have to blatantly manipulate statistics to support your argument, You are wrong. The only way the other side of the argument has any leg to stand on is if there is no police bias against black people. Yet there are roughly 6 black men in prison for every white man. We're the majority out here but a minority in prison. Anyone who honestly believes that black people commit 6x more crimes than white people is an ignorant racist. Because every study ever done on the matter, Including nazi Germany, Came to the conclusion that all races are breaking the law at more or less the same rate. Speaking of nazi's, They are still a thing in Germany and even they are looking down at us for our racism. Finally if you have to continuously say \"I am not a racist\" then you absolutely are a racist and you're part of the problem. Because you're using that phrase to defend racist statements and you use it over and over and over again. Do you really think no one can see through that? People who aren't racist literally never have to say that phrase because they don' t say racist shit in the first place."}, {"title": "I support the Black Lives Matter movement.", "body": "I support the Black Lives Matter movement because daily African Americans are mistreated, Murdered, And ignored. Yearly cops are murdering black lives and they are let off free, Most get suspended, But very few get justice they deserve. The justice system is outdated and people are tired of the racial injustice. Black lives must be treated equal as one before all lives matter. Matter is the minimum, Black lives are worthy! Black lives are not disposable! Black lives are needed! Black lives are HUMAN!"}, {"title": "Of course Black Lives Matter", "body": "This shouldn't be a thing people are arguing about. If you read and contextualize the statistics black people are being killed at a disproportionate rate. They make up 13 percent of the population and have been suffering from oppression for centuries. From slavery to Jim Crow laws, To redlining, And the war on drugs. We need to stand by their side and help fight the constant racism they experience. I hope people can understand that this movement is not against them, This movement is trying to fight for racial equality in America."}, {"title": "If you don't you are racist or ignorant.", "body": "It appals me to see how many people are opposed to equality on the other side. They use few statistics, And those they do use are not properly being examined, Misleading the ill-informed. People are associating a movement with the actions of a few individuals. You can see that in the last week the protests have become less violent, Coincidentally just as the police force in the USA becomes more civil as they are globally condemned for their response to the protests. Some statues have been removed, However many protestors instead want people to recognise that the historical people we hold up as champions were not perfect, And had some deep flaws based on society at the time. Just as many are requesting that especially egregious figures instead be replaced by equally as important figures who didn't hold white supremacist views. Although White individuals may be killed more often by Police than Black individuals, You would expect this when they make up around 60% of the population compared to 26%. When taking into consideration percent of the population by skin colour, Black individuals are 3 times as more likely to be killed than their White colleagues. Police are also not charged 99% of the time, Which shows just how much they get away with. At most they may have to switch county, But they are still able to remain police officers. ISIS tries to kill people while Black Lives Mater doesn't, So there is no sane comparison. The first world was trashed by the elitist white supremacy viewpoint, Unless you liked the good old days of slavery, Then yes it trashed your ability to be an abhorrent human being. Also if you ever feel like you may become a minority, And feel in danger then; you will know how every non-white person feels, And can simply go back to Europe where all the Europeans live. Also calling African-American people criminals without any evidence is racist, Making you, At least partly racist. Black Lives Matter has nothing to do with religion so it cannot be Anti-Semitic (hatred against Judaism). Black Lives Matter does not call for African-Americans to become the leaders of society, Only asking that they can have the same basic rights, Protections and ability to not fear for their lives every living second. The All Lives Matter movement calls for the status quo to remain, Which means only white lives matter."}, {"title": "Black Lives Matter", "body": "Why is this statement controversial? It simply states that the lives of Black people matter. The fact that this statement even needs to be made emphasizes it's relevance. To not be able to accept this simple phrase, To say, 'yes, The lives of Black people matter'. There is perhaps another argument to be had about the violence taking place, Whether it is relevant to the cause, Whether it helps or harms the cause. But why is the violence occurring? Watching social media, We can clearly see that police are agitating often peaceful demonstrations. The police response to a protest directed at their brutality has been to increase their violence - what options do the protesters have then but to respond with violence?"}, {"title": "Black lives matter.", "body": "To everyone who's counter-argument is \"all lives matter\": All lives can't matter until black lives matter. Last time I checked, They don't yet. Black Americans are 2. 5X more likely to be a victim of police brutality. Yes, More white people get brutalized by the police every year, But people of color are considered \"minorities\" for a reason. When you adjust the statistics to accommodate that fact, You end up with the 2. 5x. No one is advocating for \"black supremacy\". They're just anti white supremacy. White privilege is real. Being privileged doesn't mean you don't have struggles. It just means the color of your skin isn't one of them. You're not oppressed."}, {"title": "Obviously. Why wouldn't they.", "body": "Sorry, But they do matter. If you can't get that through your thick skull, Then that's your problem. Watch the movie Amistad. It'll help you realize what has happened to these poor people throughout history. Racism is an evil, Ugly mark on society, And if you are against BLM, You're racist."}, {"title": "Of course black lives matter", "body": "The Black Lives Matter movement is not saying that everyone else's lives do not. It is simply saying that black people have been treated like their lives do not matter. The movement is taking a stand. Think of it as saying Black Lives Matter TOO. I'm white but I will always support the movement."}, {"title": "Black Lives Do Matter.", "body": "All of the protestings are necessary because people have looked down on Black people for thousands of years now and it is time to change. Now destroying people's stores and all of their hard work is not ok but all of the peaceful protests are getting now where Black people are still dying and are not getting justice until this stops. We are all human and we are all the same it does not matter what color your skin is. WE ARE THE SAME."}], "con_arguments": [{"title": "All Normal Human Lives Matter, That includes black lives.", "body": "It isn't just black lives who matter. There are white lives and other human lives. ALL LIVES MATTER. Got it? ALL NORMAL HUMAN LIVES MATTER. Normal boys' lives, Normal girls' lives, Normal mens' lives, Normal womens' lives. Not gross trannies, Degenerates nor sjws nor feminazis who believe in degenerative ideologies such as abortion and there being \"more than two genders\". All this bs is coming from the leftists/globalists. WAKE UP PEOPLE. KNOW THE TRUTH AND THE TRUTH SHALL SET YOU FREE. Racism doesn't go one way, It goes both ways and right now, Blacks have become more racist than whites. Not all blacks are like this but still. Whites are not to blame when a black guy or girl DOES COMMIT A CRIME. TAKE RESPONSIBILITY FOR YOUR OWN ACTIONS. EVERY MAN AND WOMAN, EVERY BOY, EVERY GIRL HAS TO, GOT IT? IT DOESN'T MATTER WHAT HIS OR HER BACKGROUND IS. DO NOT BLAME ANOTHER FOR SOMETHING YOU DID."}, {"title": "The Black Lives Matter movement is a Terrorist   group, Racist & Anti-Semitic", "body": "I have nothing against black people, I have many black friends, But the Fact is The Black Lives Matter movement is all built on Lies, Lies, Every year in America Far More White People, Far More White Men in America are killed every year by Police than Black Men. Far More White People and White Men are killed by Police in America every year than Black people and Black Men. The death of George Floyd was very tragic, but if George Floyd was White, Would anyone care? Black Lives Matter is a Hate Group, a Terrorist Organization, And is Racist, Anti-Semitic and built upon LIES,"}, {"title": "Things have turned violent", "body": "Originally I was supportive of the movement however after a while I realised that many people started taking things to the next level. They are assaulting police officers, Threatening to pull down extremely historical statues even though they have little evidence (Winston Churchill in parliament square and Robert Baden-Powell the founder of scouts). They are turning into a violent angry mob who are breaking social distancing regulations which threatens a second outbreak. I am just waiting for the headlines to say that either a police officers or a protester is killed."}, {"title": "They have no clear goals", "body": "The statistics at DOJ absolutely do not agree with the BLM movement. There are a COUPLE studies done at highly liberal universities showing that cops are more likely to shoot, Pull over, Etc blacks. But most studies found no difference. If a meta analysis was performed it would likely show NO DIFFERENCE. Also, Yes, Cops do racially profile. Why? Blacks perform more crime x5. Just look on the DOJ."}, {"title": "It's a front", "body": "It is a total front by the ADL and MOSSAD and jew in general. FACT. They interfere with every grassroots protest. THIS IS NOT GRASSROOTS. This is a SCAM. FACT. The jew is the spawn of Satan. There were BRICKS placed outside of a Home Depot to make them RIOT on purpose. . ."}, {"title": "Black Lives Matter is truly segregative and it has failed to address equally all racism", "body": "I voiced an opinion as an Asian. Now, Do you think that Black Lives Matter represents for anti-racism, Or just only fighting for the people of Black-skin, Like those from Sub-Saharan Africa? I sympathize with the Black people who suffered racism, But what about Black racism toward non-Black subjects? Also, The people who are of Asian and European origins who lived in Africa have been forcibly chased away because of their economic achievements. Remember Indians expelled by Idi Amin in Uganda? What about Lebanese people being forcibly removed in West Africa, Too? Likewise, You forget that Black Lives Matter has ignored the increasing racist situation against Black people in Asia, For instance, China, Japan, Korea, Vietnam and even Thailand and India, Where the hatred against black-skinned people went undetected - they just instead shouting against America for racism and yet ignoring it. We're all fuckin' human, First. Ignorant is a bliss, Son. Black people deserve equality, But they need to check their fanaticism and partiality, Too."}, {"title": "BLM is racist", "body": "Before you judge this look at what BLM is actually doing. They riot and loot businesses and this affects employees that are black. They may lose their jobs because of them. Also, If you are a black liberal, Hooray! But a black conservative? You don't matter. Also, They don't seem to care about unborn black babies. They side with Planned Parenthood even though it was created to kill off their population. BLM is racist"}, {"title": "No, I will never support a black supremacist movement like BLM", "body": "Like the headline says, BLM is a black supremacist movement that is extremely racist towards whites and extremely intolerant towards anyone who disagrees with them. They are a cult and it's sad to see that this propaganda is being pushed in our public schools. Also BLM's founders admitted that they are Marxists and BLM is against the nuclear family(it says it on their website under their what we believe page). Plus the riots they cause have destroyed small business, Apartments, And caused billions in damage. So yea, I don't agree with BLM"}, {"title": "BLM Wants Superiority to Whites", "body": "Stop pretending that African Americans are so oppressed here. There is no law today in America that supports discrimination. If African Americans are equal in law then they are equal. This movement seeks to make it impossible to pull over or arrest an African American because then you are deemed to be a racist and fired form your job. Go look at South Africa where the blacks have killed thousands of white farmers in racially motivated attacks in order to take their land. The government has even passed laws that allow the seizure of white property without compensation. That is racism."}, {"title": "Who is killing blacks?", "body": "In 2019 race of people killed by police nationally:White 370 (36%)Black 235 (23%)Hispanic 158Other 39Unknown 202If we look at Homicide by race we see out of 2, 491 blacks being killed, 2, 245 were killed by blacks, And only 189 by whites. So if you conclude that Black lives matter, I agree, But so does any person, Not just blacks. And if you want to make the biggest impact on saving black lives from homicide, You need to look at blacks first, Simply by numbers."}]},
{"topic": "Do you agree with the Derek Chauvin   guilty verdict   announced on April 20, 2021. . . ?", "category": "Politics", "pro_arguments": [{"title": "Mauvin murdered Floyd.", "body": "If you punch an old person and they die because of complications of being old, You are still responsible for their death. Which is why the fentanyl argument down below is garbage. If someone tells you they can't breathe, Then the last thing you want to do is place your knee on their neck with excessive force. Mauvin responded to Floyd's pleas that he cannot breathe by telling him to quit talking. He didn't say calm down. He didn't say relax. His response was arrogant, Dismissive, And callous, Highlighting his malicious intent."}, {"title": "He used excessive force, Therefore the causal factor for the victims death.", "body": "Had the officer of only used reasonable force, George Floyd would still be alive. George floyd was in handcuffs, Laid on the concrete floor, So the kneeling on him was excessive. The officer knew better, Was trained and failed in his duty to protect all citizens even those under arrest, So the question that must be asked is why did no one else step in to protect George before his death?"}, {"title": "Chaha real smooth", "body": "Dededeede turn to work Derek kills a another one, Hop one time, Derek is a mruder worst than a serial killer, 2 kills this time yeahhhh that's how justice works my chideren police are always above the law. Derek goes to work kills 3 this time   he laughs as he gets free after killing 10 more people!"}], "con_arguments": [{"title": "No. The decision was made under threat of riots.", "body": "The defence provided resonable doubt that Chauvin was using a standard police restraint tactic after Floyd refused to be put in the back of the car. They also proved that Floyd had 3x the overdose level of fentanyl in his system and had no damage to his corrated arteries or trachea (which would be present if his neck was being crushed)."}, {"title": "No, To excessive.", "body": "He should have been charged with assault and unlawful use of force, And maybe murder, But since Floyd was resisting arrest I cannot say for sure, Floyd probably wouldn't have died if there was no drugs n his system, Kneeling on a grown mans neck for even ten minutes probably would not kill him, As you are kneeling, If   Chauvin had truly applied real force during the kneel, Then Floyds neck would have been crushed long before he died."}, {"title": "The decision was made based on fear, Not on justice.", "body": "The trial showed significant evidence to show doubts of what the public narrative showed. The fact that Floyd was high to the bones, With his dealer in the car, And a speedball found with his saliva and ADN. Prior to the accident, He was warned by his doctor of having a \"weak heart\", That wasn't able to resist all drugs he was consuming. Even though this is more than enough to doubt his culpability, Fear was the prime motivation in the decision making. With 300 blm protestors outside the court and maxine waters literal call for violence, Clearly the motivation was based on fear and not on justice. Plus the fact they came to a decision extremely fast and this being a hugely televised spectacle (the death of Floyd with the subsequent blm \"protests\"), People had a pre existing opinion based on the media narrative (that undeniably exist considering Project Veritas CNN exposure video of one of the heads of it stating they wanna \"help blm\" while being so called \"objective journalism\")."}]}
]